assembly/Nasm.org
#+title:  NASM源码阅读笔记
#+OPTIONS: ^:nil _:nil


* 各模块简介：
    NASM按功能将汇编器的各个部分独立为模块，各个模块之间并不进行直接的联系。
    这种编程结构使得阅读源代码变得轻松起来，可以将各个模块独立出来分别阅读。
    在源码中的doc/internal.doc中有一个模块间的结构图：
#+BEGIN_EXAMPLE
                  +--- preproc.c ----+
                  |                  |
                  +---- parser.c ----+
                  |        |         |
                  |     float.c      |
                  |                  |
                  +--- assemble.c ---+
                  |        |         |
        nasm.c ---+     insnsa.c     +--- nasmlib.c
                  |                  |
                  +--- listing.c ----+
                  |                  |
                  +---- labels.c ----+
                  |                  |
                  +--- outform.c ----+
                  |                  |
                  +----- *out.c -----+
#+END_EXAMPLE


图中没有出现的其它模块有eval.c和float.c。eval.c是表达式求值模块,用于
preproc.c,parser.c和*out.c；float.c是浮点数常量存储转换模块，用于parser.c。
各模块将需要导出的函数和数据结构的定义放入对应的头文件中，以便被其它模块调用。

**需要注意的是许多函数指针或包含函数指针的结构以参数的形式在各模块间传递，
这种间接性使得模块之间的结构更加清晰。**
   
** 强大的预处理器preproc.c:

预处理部分是NASM中最复杂，也是代码最多的模块，有四千多行代码。
它使用自己的源码扫描程序ppscan，支持名字相同但参数不同的宏，支持
各个宏通过上下文相关堆栈来交换信息，支持宏内进行预处理循环等。
(可参阅NASM使用文档来了解预处理的功能和使用方法)

preproc.c对外仅导出一个结构：
#+BEGIN_SRC C
  typedef struct {
      /*
       * Called at the start of a pass; given a file name, the number
       * of the pass, an error reporting function, an evaluator
       * function, and a listing generator to talk to.
       */
      void (*reset) (char *, int, efunc, evalfunc, ListGen *);

      /*
       * Called to fetch a line of preprocessed source. The line
       * returned has been malloc'ed, and so should be freed after
       * use.
       */
      char *(*getline) (void);

      /*
       * Called at the end of a pass.
       */
      void (*cleanup) (int);
  } Preproc;
#+END_SRC

其中reset用于初始化，cleanup用于预处理后的清理工作。
而函数名getline则是相对于主程序来说的。它对编译器内嵌的宏和汇编源程序
从上至下进行处理，记录遇到的宏信息，用实际的代码和数据替换调用的宏，并
返回一行可以被下一个模块(这里是parser.c)使用的“规范的”汇编代码。

**预处理部分相对于主程序后面调用的模块来说是透明的。**

** 功能单一的解析模块parser.c:

按作者的说法，解析模块的作用就是解析由`标号',`指令',`操作数'和`注释'组成的
“规范的”汇编代码行，填充并返回这行代码的insn结构：
#+BEGIN_SRC C
  typedef struct {                    /* an instruction itself */
      char *label;                    /* the label defined, or NULL */
      int prefixes[MAXPREFIX];       /* instruction prefixes, if any */
      int nprefix;                    /* number of entries in above */
      int opcode;                     /* the opcode - not just the string */
      int condition;                  /* the condition code, if Jcc/SETcc */
      int operands;                   /* how many operands? 0-3 
                                      * (more if db et al) */
      operand oprs[3];        /* the operands, defined as above */
      extop *eops;                    /* extended operands */
      int eops_float;                /* true if DD and floating */
      long times;                     /* repeat count (TIMES prefix) */
      int forw_ref;                   /* is there a forward reference? */
  } insn;
#+END_SRC

该模块导出三个函数：
#+BEGIN_SRC C
  void parser_global_info (struct ofmt *output, loc_t *locp);
  insn *parse_line (int pass, char *buffer, insn *result,
                 efunc error, evalfunc evaluate, ldfunc ldef);
  void cleanup_insn (insn *instruction);
#+END_SRC

其中parser_global_info用于解析前的初始化工作(这里是初始化输出的文件格式和
当前行所在的位置，在定义标号时需要用到)。cleanup_insn用于解析后的清理工作。

而parse_line的功能就是按照上面提到的`标号',`指令',`操作数'和`注释'的
顺序对buffer里的代码进行解析，并对相应部分的合法性做一些检查，比如检查指令的前缀是
不是超过了所能允许的最大值，操作数是否为内存地址，代码中是否含有一个向前的引用等。
它还提供了对伪指令DB,DD,RESB,RESD,INCBIN等的支持。

