assembly/Nasm.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-05-23 Thu 12:46 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>NASM源码阅读笔记</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Jingtao Xu" />


 <link rel="stylesheet" type="text/css" href="/css/core.css" />
 <link rel="shortcut icon" href="/images/web/favicon.ico" />
 <link rel="icon" type="image/gif" href="/images/web/animated_favicon1.gif" />
 <META NAME="keywords" CONTENT="jingtao,elisp,lisp,common lisp,emacs,org-mode,muse,mew,assembly,masm32,masm,win32,nasm" />

</head>
<body>

 <ul class="navigation">
 <li class="site-name">Jingtao Xu</li>
 <li><a accesskey="a" href="/index.html">Articles</a></li>
 <li><a accesskey="c" href="https://github.com/jingtaozf">Code</a></li>
 <li><a accesskey="A" href="/about.html">About</a></li>
 </ul><div id="preamble" class="status">

    <script type="text/javascript">//<![CDATA[
  this.onload = function () {
  (new Image()).src = "http://cb.amazingcounters.com/counter.php?i=2623438&c=7870627";
 }
 //]]></script>
</div>
<div id="content">
<h1 class="title">NASM源码阅读笔记</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org3a909c6">1. 各模块简介：</a></li>
<li><a href="#org26dcb3f">2. 流程简介：</a></li>
<li><a href="#org6e5c974">3. 阅读小结</a></li>
</ul>
</div>
</div>


<div id="outline-container-org3a909c6" class="outline-2">
<h2 id="org3a909c6"><span class="section-number-2">1</span> 各模块简介：</h2>
<div class="outline-text-2" id="text-1">
<p>
NASM按功能将汇编器的各个部分独立为模块，各个模块之间并不进行直接的联系。
这种编程结构使得阅读源代码变得轻松起来，可以将各个模块独立出来分别阅读。
在源码中的doc/internal.doc中有一个模块间的结构图：
</p>
<pre class="example">
          +--- preproc.c ----+
          |                  |
          +---- parser.c ----+
          |        |         |
          |     float.c      |
          |                  |
          +--- assemble.c ---+
          |        |         |
nasm.c ---+     insnsa.c     +--- nasmlib.c
          |                  |
          +--- listing.c ----+
          |                  |
          +---- labels.c ----+
          |                  |
          +--- outform.c ----+
          |                  |
          +----- *out.c -----+
</pre>


<p>
图中没有出现的其它模块有eval.c和float.c。eval.c是表达式求值模块,用于
preproc.c,parser.c和*out.c；float.c是浮点数常量存储转换模块，用于parser.c。
各模块将需要导出的函数和数据结构的定义放入对应的头文件中，以便被其它模块调用。
</p>

<p>
<b><b>需要注意的是许多函数指针或包含函数指针的结构以参数的形式在各模块间传递，
这种间接性使得模块之间的结构更加清晰。</b></b>
</p>
</div>

<ol class="org-ol">
<li><a id="org775afbd"></a>强大的预处理器preproc.c:<br />
<div class="outline-text-3" id="text-1-1">
<p>
预处理部分是NASM中最复杂，也是代码最多的模块，有四千多行代码。
它使用自己的源码扫描程序ppscan，支持名字相同但参数不同的宏，支持
各个宏通过上下文相关堆栈来交换信息，支持宏内进行预处理循环等。
(可参阅NASM使用文档来了解预处理的功能和使用方法)
</p>

<p>
preproc.c对外仅导出一个结构：
</p>
<div class="org-src-container">
<pre class="src src-C"><span class="org-keyword">typedef</span> <span class="org-keyword">struct</span> {
    <span class="org-comment-delimiter">/*</span>
<span class="org-comment">     * Called at the start of a pass; given a file name, the number</span>
<span class="org-comment">     * of the pass, an error reporting function, an evaluator</span>
<span class="org-comment">     * function, and a listing generator to talk to.</span>
<span class="org-comment">     </span><span class="org-comment-delimiter">*/</span>
    <span class="org-type">void</span> (*reset) (<span class="org-type">char</span> *, <span class="org-type">int</span>, efunc, evalfunc, <span class="org-type">ListGen</span> *);

    <span class="org-comment-delimiter">/*</span>
<span class="org-comment">     * Called to fetch a line of preprocessed source. The line</span>
<span class="org-comment">     * returned has been malloc'ed, and so should be freed after</span>
<span class="org-comment">     * use.</span>
<span class="org-comment">     </span><span class="org-comment-delimiter">*/</span>
    <span class="org-type">char</span> *(*getline) (<span class="org-type">void</span>);

    <span class="org-comment-delimiter">/*</span>
<span class="org-comment">     * Called at the end of a pass.</span>
<span class="org-comment">     </span><span class="org-comment-delimiter">*/</span>
    <span class="org-type">void</span> (*cleanup) (<span class="org-type">int</span>);
} <span class="org-type">Preproc</span>;
</pre>
</div>

<p>
其中reset用于初始化，cleanup用于预处理后的清理工作。
而函数名getline则是相对于主程序来说的。它对编译器内嵌的宏和汇编源程序
从上至下进行处理，记录遇到的宏信息，用实际的代码和数据替换调用的宏，并
返回一行可以被下一个模块(这里是parser.c)使用的“规范的”汇编代码。
</p>

<p>
<b><b>预处理部分相对于主程序后面调用的模块来说是透明的。</b></b>
</p>
</div>
</li>

<li><a id="org9b8481d"></a>功能单一的解析模块parser.c:<br />
<div class="outline-text-3" id="text-1-2">
<p>
按作者的说法，解析模块的作用就是解析由`标号',`指令',`操作数'和`注释'组成的
“规范的”汇编代码行，填充并返回这行代码的insn结构：
</p>
<div class="org-src-container">
<pre class="src src-C"><span class="org-keyword">typedef</span> <span class="org-keyword">struct</span> {                    <span class="org-comment-delimiter">/* </span><span class="org-comment">an instruction itself </span><span class="org-comment-delimiter">*/</span>
    <span class="org-type">char</span> *<span class="org-variable-name">label</span>;                    <span class="org-comment-delimiter">/* </span><span class="org-comment">the label defined, or NULL </span><span class="org-comment-delimiter">*/</span>
    <span class="org-type">int</span> <span class="org-variable-name">prefixes</span>[MAXPREFIX];       <span class="org-comment-delimiter">/* </span><span class="org-comment">instruction prefixes, if any </span><span class="org-comment-delimiter">*/</span>
    <span class="org-type">int</span> <span class="org-variable-name">nprefix</span>;                    <span class="org-comment-delimiter">/* </span><span class="org-comment">number of entries in above </span><span class="org-comment-delimiter">*/</span>
    <span class="org-type">int</span> <span class="org-variable-name">opcode</span>;                     <span class="org-comment-delimiter">/* </span><span class="org-comment">the opcode - not just the string </span><span class="org-comment-delimiter">*/</span>
    <span class="org-type">int</span> <span class="org-variable-name">condition</span>;                  <span class="org-comment-delimiter">/* </span><span class="org-comment">the condition code, if Jcc/SETcc </span><span class="org-comment-delimiter">*/</span>
    <span class="org-type">int</span> <span class="org-variable-name">operands</span>;                   <span class="org-comment-delimiter">/* </span><span class="org-comment">how many operands? 0-3 </span>
<span class="org-comment">                                    * (more if db et al) </span><span class="org-comment-delimiter">*/</span>
    <span class="org-type">operand</span> <span class="org-variable-name">oprs</span>[3];        <span class="org-comment-delimiter">/* </span><span class="org-comment">the operands, defined as above </span><span class="org-comment-delimiter">*/</span>
    <span class="org-type">extop</span> *<span class="org-variable-name">eops</span>;                    <span class="org-comment-delimiter">/* </span><span class="org-comment">extended operands </span><span class="org-comment-delimiter">*/</span>
    <span class="org-type">int</span> <span class="org-variable-name">eops_float</span>;                <span class="org-comment-delimiter">/* </span><span class="org-comment">true if DD and floating </span><span class="org-comment-delimiter">*/</span>
    <span class="org-type">long</span> <span class="org-variable-name">times</span>;                     <span class="org-comment-delimiter">/* </span><span class="org-comment">repeat count (TIMES prefix) </span><span class="org-comment-delimiter">*/</span>
    <span class="org-type">int</span> <span class="org-variable-name">forw_ref</span>;                   <span class="org-comment-delimiter">/* </span><span class="org-comment">is there a forward reference? </span><span class="org-comment-delimiter">*/</span>
} <span class="org-type">insn</span>;
</pre>
</div>

<p>
该模块导出三个函数：
</p>
<div class="org-src-container">
<pre class="src src-C"><span class="org-type">void</span> <span class="org-function-name">parser_global_info</span> (<span class="org-keyword">struct</span> <span class="org-type">ofmt</span> *<span class="org-variable-name">output</span>, <span class="org-type">loc_t</span> *<span class="org-variable-name">locp</span>);
<span class="org-type">insn</span> *<span class="org-function-name">parse_line</span> (<span class="org-type">int</span> <span class="org-variable-name">pass</span>, <span class="org-type">char</span> *<span class="org-variable-name">buffer</span>, <span class="org-type">insn</span> *<span class="org-variable-name">result</span>,
               <span class="org-type">efunc</span> <span class="org-variable-name">error</span>, <span class="org-type">evalfunc</span> <span class="org-variable-name">evaluate</span>, <span class="org-type">ldfunc</span> <span class="org-variable-name">ldef</span>);
<span class="org-type">void</span> <span class="org-function-name">cleanup_insn</span> (<span class="org-type">insn</span> *<span class="org-variable-name">instruction</span>);
</pre>
</div>

<p>
其中parser_global_info用于解析前的初始化工作(这里是初始化输出的文件格式和
当前行所在的位置，在定义标号时需要用到)。cleanup_insn用于解析后的清理工作。
</p>

<p>
而parse_line的功能就是按照上面提到的`标号',`指令',`操作数'和`注释'的
顺序对buffer里的代码进行解析，并对相应部分的合法性做一些检查，比如检查指令的前缀是
不是超过了所能允许的最大值，操作数是否为内存地址，代码中是否含有一个向前的引用等。
它还提供了对伪指令DB,DD,RESB,RESD,INCBIN等的支持。
</p>
</div>
</li>
