assembly/Nasm.org
** 代码生成器assemble.c:

当parser.c填充好insn结构后，assemble.c就按照Intel机器码规则生成实际的
机器码，并传给out*.c来生成具体格式的目标文件。

它导出两个函数：
#+BEGIN_SRC C
  long insn_size (long segment, long offset, int bits, unsigned long cpu,
               insn *instruction, efunc error);
  long assemble (long segment, long offset, int bits, unsigned long cpu,
              insn *instruction, struct ofmt *output, efunc error,
              ListGen *listgen);
#+END_SRC

其中insn_size一般用在第一遍分析源码时，用于确定某一行代码在实际目标文件中所需的
空间，而assemble则一般用在第二遍分析源码时，它转化insn结构中的指令为实际的机器码，
并输出到out*.c中以生成具体格式的目标文件。

** 简单的表达式求值模块eval.c:

eval.c用于计算并返回代码中表达式的值，其中运算符||,^^,&&等用于条件汇编%if类指令
的表达式中，返回真或假，|,^,&,<<,+,*,/等用于对常量值进行运算，SEG，WRT等则用于得到
程序中段(或节)实际的基址和偏移。

eval.c的功能比较简单，不能像MASM那样处理类似(eax != 0)这样的表达式。(后记[1])。
eval.c利用标准的scan程序扫描表达式缓冲区，找出存在的运算符进行运算，并将
处理后的值存入expr结构中：
#+BEGIN_SRC C
  /*
   * Expression-evaluator datatype. Expressions, within the
   * evaluator, are stored as an array of these beasts, terminated by
   * a record with type==0. Mostly, it's a vector type: each type
   * denotes some kind of a component, and the value denotes the
   * multiple of that component present in the expression. The
   * exception is the WRT type, whose `value' field denotes the
   * segment to which the expression is relative. These segments will
   * be segment-base types, i.e. either odd segment values or SEG_ABS
   * types. So it is still valid to assume that anything with a
   * `value' field of zero is insignificant.
   */
  typedef struct {
      long type;                             /* a register, or EXPR_xxx */
      long value;                            /* must be >= 32 bits */
  } expr;
#+END_SRC

值得注意的是eval.c只在第一遍分析源码时处理运算符||,^^，&&等，因为它们只在
预处理表达式中才可能出现。

** 标号处理器label.c:

NASM的标号分局部标号和全局标号两种(外部标号可看作是在另一个源程序中的全局标号)。

局部标号名最终将由两部分组成："上一个全局标号名＋局部标号名"。

全局标号名最终将由三部分组成："lprefix+全局标号名+lpostfix"。

其中lprefix和lpostfix都是可选的，它们分别用于在所有的全局标号名的前面和后面添加字符串。
比如在编译时指定选项 --prefix_ 将会在所在的全局标号名前加下划线，
这就会和在C中生成标号的情况差不多。
最终label.c会将标号的相关信息传给对应的out*.c来生成目标文件中的符号。

这个模块导出以下数据和函数：
#+BEGIN_SRC C
  extern char lprefix[PREFIX_MAX];
  extern char lpostfix[PREFIX_MAX];

  int lookup_label (char *label, long *segment, long *offset);
  int is_extern (char *label);
  void define_label (char *label, long segment, long offset, char *special,
                     int is_norm, int isextrn, struct ofmt *ofmt, efunc error);
  void redefine_label (char *label, long segment, long offset, char *special,
                     int is_norm, int isextrn, struct ofmt *ofmt, efunc error);
  void define_common (char *label, long segment, long size, char *special,
                      struct ofmt *ofmt, efunc error);
  void declare_as_global (char *label, char *special, efunc error);
  int init_labels (void);
  void cleanup_labels (void);
#+END_SRC

函数init_labels和cleanup_labels分别用于内部数据的初始化和清理工作。

函数lookup_label用于查找存在的标号并返回对应的段和偏移的值。

函数define_label用于定义标号并将信息传递给相应的out*.c来生成目标文件中的符号。

函数redefine_label用于检查标号是否存在定位错误并对其进行修正(按作者的说法，虽然大多
数的汇编器都存在这个功能，但在这里好像并不能起到什么作用)。

** 列表文件生成模块listing.c:

list.c用于生成列表文件。列表文件的格式如下：

列表文件的行号 代码在目标文件中的偏移 <列表嵌套层数>　源代码行或宏展开后的代码

其中的列表嵌套层数用于INCBIN,TIMES,INCLUDE和MACRO等伪指令，用于表示这些指令展开后在
代码中嵌套的层数。在实际生成的列表文件中不对TIMES指令和指定了.nolist的宏进行展开操作。

list.c对外导出如下结构：
#+BEGIN_SRC C
  ListGen nasmlist = {
      list_init,
      list_cleanup,
      list_output,
      list_line,
      list_uplevel,
      list_downlevel
  };
#+END_SRC

其中list_init和list_cleanup分别用于模块内部数据的初始化和清理操作。

list_output用于生成列表文件格式中的的前两部分，list_line用于生成列表文件格式中的
后两部分。

list_upleve和list_downlevel被其它模块调用，以更新list.c中的列表嵌套层数。

值得注意的是源码中的数据结构MacroInhibit目前在模块中并没有什么实际的作用，而且list.c
也没有对传入的参数进行充分的处理。按作者的说法，这些函数实现并没有经过很好的考虑，
它们只是因为"差不多能够工作"，所以才被保留至今。

** 浮点数转换模块float.c:

float.c模块导出一个函数float_const：
#+BEGIN_SRC C
 int float_const (char *number, long sign, unsigned char *result, int bytes,
  efunc error);
#+END_SRC

这个函数负责将指令DD, DQ和DT后的浮点数常量转换为Intel机器内部的数据表达形式。
float.c能识别的浮点数格式如下：
#+BEGIN_QUOTE
             dd    1.2                     ; an easy one
             dq    1.e10                   ; 10,000,000,000
             dq    1.e+10                  ; synonymous with 1.e10
             dq    1.e-10                  ; 0.000 000 000 1
             dt    3.141592653589793238462 ; pi
#+END_QUOTE

需要注意的是NASM不提供浮点数的表达式求值运算，这是因为NASM认为不能保证所有
存在ANSI C编译器的的系统都提供浮点数运算的库函数，而自己实现又有点得不偿失。

