assembly/Nasm.html

<li><a id="org0ed935f"></a>代码生成器assemble.c:<br />
<div class="outline-text-3" id="text-1-3">
<p>
当parser.c填充好insn结构后，assemble.c就按照Intel机器码规则生成实际的
机器码，并传给out*.c来生成具体格式的目标文件。
</p>

<p>
它导出两个函数：
</p>
<div class="org-src-container">
<pre class="src src-C"><span class="org-type">long</span> <span class="org-function-name">insn_size</span> (<span class="org-type">long</span> <span class="org-variable-name">segment</span>, <span class="org-type">long</span> <span class="org-variable-name">offset</span>, <span class="org-type">int</span> <span class="org-variable-name">bits</span>, <span class="org-type">unsigned</span> <span class="org-type">long</span> <span class="org-variable-name">cpu</span>,
             <span class="org-type">insn</span> *<span class="org-variable-name">instruction</span>, <span class="org-type">efunc</span> <span class="org-variable-name">error</span>);
<span class="org-type">long</span> <span class="org-function-name">assemble</span> (<span class="org-type">long</span> <span class="org-variable-name">segment</span>, <span class="org-type">long</span> <span class="org-variable-name">offset</span>, <span class="org-type">int</span> <span class="org-variable-name">bits</span>, <span class="org-type">unsigned</span> <span class="org-type">long</span> <span class="org-variable-name">cpu</span>,
            <span class="org-type">insn</span> *<span class="org-variable-name">instruction</span>, <span class="org-keyword">struct</span> <span class="org-type">ofmt</span> *<span class="org-variable-name">output</span>, <span class="org-type">efunc</span> <span class="org-variable-name">error</span>,
            <span class="org-type">ListGen</span> *<span class="org-variable-name">listgen</span>);
</pre>
</div>

<p>
其中insn_size一般用在第一遍分析源码时，用于确定某一行代码在实际目标文件中所需的
空间，而assemble则一般用在第二遍分析源码时，它转化insn结构中的指令为实际的机器码，
并输出到out*.c中以生成具体格式的目标文件。
</p>
</div>
</li>

<li><a id="org5263512"></a>简单的表达式求值模块eval.c:<br />
<div class="outline-text-3" id="text-1-4">
<p>
eval.c用于计算并返回代码中表达式的值，其中运算符||,^^,&amp;&amp;等用于条件汇编%if类指令
的表达式中，返回真或假，|,^,&amp;,&lt;&lt;,+,*,/等用于对常量值进行运算，SEG，WRT等则用于得到
程序中段(或节)实际的基址和偏移。
</p>

<p>
eval.c的功能比较简单，不能像MASM那样处理类似(eax != 0)这样的表达式。(后记[1])。
eval.c利用标准的scan程序扫描表达式缓冲区，找出存在的运算符进行运算，并将
处理后的值存入expr结构中：
</p>
<div class="org-src-container">
<pre class="src src-C"><span class="org-comment-delimiter">/*</span>
<span class="org-comment"> * Expression-evaluator datatype. Expressions, within the</span>
<span class="org-comment"> * evaluator, are stored as an array of these beasts, terminated by</span>
<span class="org-comment"> * a record with type==0. Mostly, it's a vector type: each type</span>
<span class="org-comment"> * denotes some kind of a component, and the value denotes the</span>
<span class="org-comment"> * multiple of that component present in the expression. The</span>
<span class="org-comment"> * exception is the WRT type, whose `value' field denotes the</span>
<span class="org-comment"> * segment to which the expression is relative. These segments will</span>
<span class="org-comment"> * be segment-base types, i.e. either odd segment values or SEG_ABS</span>
<span class="org-comment"> * types. So it is still valid to assume that anything with a</span>
<span class="org-comment"> * `value' field of zero is insignificant.</span>
<span class="org-comment"> </span><span class="org-comment-delimiter">*/</span>
<span class="org-keyword">typedef</span> <span class="org-keyword">struct</span> {
    <span class="org-type">long</span> <span class="org-variable-name">type</span>;                             <span class="org-comment-delimiter">/* </span><span class="org-comment">a register, or EXPR_xxx </span><span class="org-comment-delimiter">*/</span>
    <span class="org-type">long</span> <span class="org-variable-name">value</span>;                            <span class="org-comment-delimiter">/* </span><span class="org-comment">must be &gt;= 32 bits </span><span class="org-comment-delimiter">*/</span>
} <span class="org-type">expr</span>;
</pre>
</div>

<p>
值得注意的是eval.c只在第一遍分析源码时处理运算符||,^^，&amp;&amp;等，因为它们只在
预处理表达式中才可能出现。
</p>
</div>
</li>

<li><a id="org449faae"></a>标号处理器label.c:<br />
<div class="outline-text-3" id="text-1-5">
<p>
NASM的标号分局部标号和全局标号两种(外部标号可看作是在另一个源程序中的全局标号)。
</p>

<p>
局部标号名最终将由两部分组成："上一个全局标号名＋局部标号名"。
</p>

<p>
全局标号名最终将由三部分组成："lprefix+全局标号名+lpostfix"。
</p>

<p>
其中lprefix和lpostfix都是可选的，它们分别用于在所有的全局标号名的前面和后面添加字符串。
比如在编译时指定选项 &#x2013;prefix_ 将会在所在的全局标号名前加下划线，
这就会和在C中生成标号的情况差不多。
最终label.c会将标号的相关信息传给对应的out*.c来生成目标文件中的符号。
</p>

<p>
这个模块导出以下数据和函数：
</p>
<div class="org-src-container">
<pre class="src src-C"><span class="org-keyword">extern</span> <span class="org-type">char</span> <span class="org-variable-name">lprefix</span>[PREFIX_MAX];
<span class="org-keyword">extern</span> <span class="org-type">char</span> <span class="org-variable-name">lpostfix</span>[PREFIX_MAX];

<span class="org-type">int</span> <span class="org-function-name">lookup_label</span> (<span class="org-type">char</span> *<span class="org-variable-name">label</span>, <span class="org-type">long</span> *<span class="org-variable-name">segment</span>, <span class="org-type">long</span> *<span class="org-variable-name">offset</span>);
<span class="org-type">int</span> <span class="org-function-name">is_extern</span> (<span class="org-type">char</span> *<span class="org-variable-name">label</span>);
<span class="org-type">void</span> <span class="org-function-name">define_label</span> (<span class="org-type">char</span> *<span class="org-variable-name">label</span>, <span class="org-type">long</span> <span class="org-variable-name">segment</span>, <span class="org-type">long</span> <span class="org-variable-name">offset</span>, <span class="org-type">char</span> *<span class="org-variable-name">special</span>,
                   <span class="org-type">int</span> <span class="org-variable-name">is_norm</span>, <span class="org-type">int</span> <span class="org-variable-name">isextrn</span>, <span class="org-keyword">struct</span> <span class="org-type">ofmt</span> *<span class="org-variable-name">ofmt</span>, <span class="org-type">efunc</span> <span class="org-variable-name">error</span>);
<span class="org-type">void</span> <span class="org-function-name">redefine_label</span> (<span class="org-type">char</span> *<span class="org-variable-name">label</span>, <span class="org-type">long</span> <span class="org-variable-name">segment</span>, <span class="org-type">long</span> <span class="org-variable-name">offset</span>, <span class="org-type">char</span> *<span class="org-variable-name">special</span>,
                   <span class="org-type">int</span> <span class="org-variable-name">is_norm</span>, <span class="org-type">int</span> <span class="org-variable-name">isextrn</span>, <span class="org-keyword">struct</span> <span class="org-type">ofmt</span> *<span class="org-variable-name">ofmt</span>, <span class="org-type">efunc</span> <span class="org-variable-name">error</span>);
<span class="org-type">void</span> <span class="org-function-name">define_common</span> (<span class="org-type">char</span> *<span class="org-variable-name">label</span>, <span class="org-type">long</span> <span class="org-variable-name">segment</span>, <span class="org-type">long</span> <span class="org-variable-name">size</span>, <span class="org-type">char</span> *<span class="org-variable-name">special</span>,
                    <span class="org-keyword">struct</span> <span class="org-type">ofmt</span> *<span class="org-variable-name">ofmt</span>, <span class="org-type">efunc</span> <span class="org-variable-name">error</span>);
<span class="org-type">void</span> <span class="org-function-name">declare_as_global</span> (<span class="org-type">char</span> *<span class="org-variable-name">label</span>, <span class="org-type">char</span> *<span class="org-variable-name">special</span>, <span class="org-type">efunc</span> <span class="org-variable-name">error</span>);
<span class="org-type">int</span> <span class="org-function-name">init_labels</span> (<span class="org-type">void</span>);
<span class="org-type">void</span> <span class="org-function-name">cleanup_labels</span> (<span class="org-type">void</span>);
</pre>
</div>

<p>
函数init_labels和cleanup_labels分别用于内部数据的初始化和清理工作。
</p>

<p>
函数lookup_label用于查找存在的标号并返回对应的段和偏移的值。
</p>

<p>
函数define_label用于定义标号并将信息传递给相应的out*.c来生成目标文件中的符号。
</p>

<p>
函数redefine_label用于检查标号是否存在定位错误并对其进行修正(按作者的说法，虽然大多
数的汇编器都存在这个功能，但在这里好像并不能起到什么作用)。
</p>
</div>
</li>

<li><a id="org563442a"></a>列表文件生成模块listing.c:<br />
<div class="outline-text-3" id="text-1-6">
<p>
list.c用于生成列表文件。列表文件的格式如下：
</p>

<p>
列表文件的行号 代码在目标文件中的偏移 &lt;列表嵌套层数&gt;　源代码行或宏展开后的代码
</p>

<p>
其中的列表嵌套层数用于INCBIN,TIMES,INCLUDE和MACRO等伪指令，用于表示这些指令展开后在
代码中嵌套的层数。在实际生成的列表文件中不对TIMES指令和指定了.nolist的宏进行展开操作。
</p>

<p>
list.c对外导出如下结构：
</p>
<div class="org-src-container">
<pre class="src src-C"><span class="org-type">ListGen</span> <span class="org-variable-name">nasmlist</span> = {
    list_init,
    list_cleanup,
    list_output,
    list_line,
    list_uplevel,
    list_downlevel
};
</pre>
</div>

<p>
其中list_init和list_cleanup分别用于模块内部数据的初始化和清理操作。
</p>

<p>
list_output用于生成列表文件格式中的的前两部分，list_line用于生成列表文件格式中的
后两部分。
</p>

<p>
list_upleve和list_downlevel被其它模块调用，以更新list.c中的列表嵌套层数。
</p>

<p>
值得注意的是源码中的数据结构MacroInhibit目前在模块中并没有什么实际的作用，而且list.c
也没有对传入的参数进行充分的处理。按作者的说法，这些函数实现并没有经过很好的考虑，
它们只是因为"差不多能够工作"，所以才被保留至今。
</p>
</div>
</li>

<li><a id="orgc243255"></a>浮点数转换模块float.c:<br />
<div class="outline-text-3" id="text-1-7">
<p>
float.c模块导出一个函数float_const：
</p>
<div class="org-src-container">
<pre class="src src-C"><span class="org-type">int</span> <span class="org-function-name">float_const</span> (<span class="org-type">char</span> *<span class="org-variable-name">number</span>, <span class="org-type">long</span> <span class="org-variable-name">sign</span>, <span class="org-type">unsigned</span> <span class="org-type">char</span> *<span class="org-variable-name">result</span>, <span class="org-type">int</span> <span class="org-variable-name">bytes</span>,
 <span class="org-type">efunc</span> <span class="org-variable-name">error</span>);
</pre>
</div>

<p>
这个函数负责将指令DD, DQ和DT后的浮点数常量转换为Intel机器内部的数据表达形式。
float.c能识别的浮点数格式如下：
</p>
<blockquote>
<p>
dd    1.2                     ; an easy one
dq    1.e10                   ; 10,000,000,000
dq    1.e+10                  ; synonymous with 1.e10
dq    1.e-10                  ; 0.000 000 000 1
dt    3.141592653589793238462 ; pi
</p>
</blockquote>

<p>
需要注意的是NASM不提供浮点数的表达式求值运算，这是因为NASM认为不能保证所有
存在ANSI C编译器的的系统都提供浮点数运算的库函数，而自己实现又有点得不偿失。
</p>
</div>
</li>
