assembly/Nasm.org
** 指令模板集模块insnsa.c:

NASM的CVS库中有三个与该模块有关的文件：

 - insns.h(指令模板结构定义和其它常量定义),
 - insns.dat(NASM能识别的Intel指令集信息表)，
 - insns.pl(用于从insns.dat中生成insnsa.c, insnsd.c, insnsi.h, insnsn.c等文件的Perl脚本)。

在insns.pl生成的四个文件中，insnsa.c和insnd.c是C格式的指令集信息表，分别用于
assemble.c和ndisasm.c。insnsi.h是指令集名字的枚举表，insnsn.c是指令集名字的字符串表，
这两个文件用在扫描(nasmlib.c)和反汇编(ndisasm.c)中。

** 为其它模块提供支持的nasmlib.c:

nasmlib.c提供如下函数：
 - 具有报错和记录功能的内存分配和释放函数;
 - 字符串和数字间的转换和赋值函数;
 - 对动态分配的随机存储数组(RAA)和顺序存储数组(SAA)进行管理的函数;
 - 一个标准的源码扫描函数;
 - 表达式处理的库函数;
 - 为目标文件自动添加扩展名的函数;
 - 对源码和目标文件提供支持的其它函数。

** 目标格式文件输出模块output\*out.c和对其进行管理的模块outform.c：

output目录下的*out.c是NASM所能输出的目标格式文件的源代码实现。
每一个输出模块一般只导出一个ofmt形式的数据结构(ofmt数据结构的定义可参见nasm.h文件)。

out*.c还提供了对特定格式的附加指令支持。
比如如果在生成OBJ格式时想导入其它DLL的函数，可以使用import指令，
如下将导入wsock32.dll中的函数WSAStartup：
#+BEGIN_QUOTE
import WSAStartup wsock32.dll
#+END_QUOTE

outform.c提供了对上述模块进行查找，列举和注册的功能。

* 流程简介：

主程序nasm.c的流程如下：

 1. 初始化需要的数据结构，注册编译器支持的目标文件格式。
 2. 使用内部函数parse_cmdline解析命令行参数，设置对应的参数值或输出相应的帮助信息后退出。
 3. 如果生成的目标格式中含有附加的标准宏，调用预处理中的函数对其进行注册。
 4. 调用函数parser_global_info和eval_global_info分别初始化parser.c和eval.c。
 5. 根据变量operating_mode的值判断操作模式，默认为op_normal。
  - 如果operating_mode为op_depend(编译时指定了参数-M)，
   则对外输出makefile格式的文件依赖关系;
  - 如果operating_mode为op_preprocess(编译时指定了参数-e)，
   则只对源代码进行预处理操作，并添加相应的行号信息，然后输出到目标文件或标准输出(stdout);
  - 如果operating_mode为op_normal，则先调用函数init_labels和ofmt->init
   分别初始化label.c和out*.c，
   然后调用函数assemble_file对源文件进行编译处理。
 6. 释放掉程序动态分配的内存(RAA和SAA),调用函数eval_cleanup和nasmlib_cleanup
    进行相应模块的清理工作。然后根据变量terminate_after_phase的值设置程序返回值并结束运行。

其中的函数 **assemble_file** 负责了最主要的工作，它接收源程序文件名，
并调用各个模块对源程序进行预处理，解析，编译，生成指定目标格式文件等操作。

**assemble_file** 函数流程如下：

 1. 初始化目标文件格式中的段(节)和偏移值，初始化预处理模块，设置当前扫描次数。
 2. 调用预处理模块中的函数preproc->getline()返回一行可以被解析使用的“标准”汇编代码，
    并增加当前行数。
 3. 调用函数getkw(line,&value)来判断当前行格式是否为[directive value]并返回
    directive和value相应的值。
    这里的directive是指NASM自己的一些伪指令，例如SECTION，EXTERN，GLOBAL等。
    若上述格式getkw无法识别，则调用ofmt->directive (line+1, value, 1)来判断
    是否为目标文件格式的附加指令。
 4. 若当前行不是上述格式，则调用标准的解析函数parse_line解析当前行。
 5. 记录或处理当前行指令中的向前引用。
 6. 处理EQU指令，并只在第二次解析时才处理标号前缀为".."的特殊EQU指令。
 7. 调用编译模块进行处理。第一次扫描源码时调用insn_size，并对伪指令RESB，DB等调用
    函数ofmt->current_dfmt->debug_typevalue(typeinfo)来设置调试信息;
    第二次扫描时则直接调用assemble来生成目标代码。
 8. 调用函数preproc->cleanup()和nasmlist.cleanup()进行扫描后的清理工作。
 9. 若扫描次数小于2,则跳转到(1)进行下一遍扫描。


* 阅读小结

通过对NASM源码的阅读，我认为它有以下优点：
 1. 采用了模块化的开发模式，各个模块间相对独立，便于扩展功能和修改，也利于被其它程序使用。
 2. 预处理功能比较强大，对宏的命名和参数量要求比较灵活。
 3. 使用了通过HASH运算将数组和链表结合在一起的数据结构，提高了查找效率。
 4. 使用文档和代码间的注释相当齐全，便于他人阅读。

同时，NASM也存在以下问题：
 1. 各模块间无法进行相互间的通信。这就导致模块间存在一些重复性代码。
    另外在模块内部也有少许重复代码。
 2. listing.c模块和eval.c模块功能简单，特别是listing.c目前尚不完善。
 3. 实质上的架构只提供了两遍的源码扫描，这就导致它对表达式的要求比较严格，
    不能处理需要多遍扫描才能完成的表达式，这方面的内容可参阅NASM的帮助文档中的
    Critical Expressions一节。
 4. 在可输出的目标格式文件中，只有少数几个支持生成含有调试信息的目标文件。

---------------------------------------------------------------------
仓促之间，错漏难免，敬请指正。
    Homepage: [[http://www.jingtao.net][www.jingtao.net]]   
    Email   : [[mailto:jingtaozf@gmail.com][jingtaozf@gmail.com]]

Footnotes:
 [1] 虽然NASM不能处理浮点数的的运算，但不意味着它不能利用自己强大的宏功能来
处理类似(eax != 0)的表达式。网友bg7jzw通过在宏中附加指令的方法来使
NASM像MASM一样支持ADDR关键字。同样的方法也可以实现对类似(eax != 0)表达
式的支持。

callapi宏如下：
#+BEGIN_SRC asm
  ;example: callapi BeginPaint,dword [hWnd], addr [ps]
  %idefine ADDR               "ADDR",
  %imacro callapi 1-*
  %assign i   %0
          %if %0 > 1
                  %rep %0 - 1
                          %rotate -1
                          %assign i   i-1

                          ;查看前一个数是否为'ADDR'
                          %rotate -1
                          %ifidni %1,"ADDR"
                                  ;将参数列表移到当前并处理
                                  %rotate 1
                                  lea eax,    %1
                                  push        eax
                                  ;跳过ADDR参数
                                  %rotate -1
                                  %assign i   i-1
                          %else
                                  %rotate 1
                                  xpush {%1}
                          %endif


                          %if i <=1
                                  %exitrep
                          %endif
                  %endrep
                  %rotate -1
          %endif
          extern      %1
          call        [%1]
  %endmacro
#+END_SRC

    /*$Id: nasm_1.html,v 1.6 2003/12/09 10:39:09 jingtao Exp $*/


