assembly/Nasm.html

<li><a id="org7d602e2"></a>指令模板集模块insnsa.c:<br />
<div class="outline-text-3" id="text-1-8">
<p>
NASM的CVS库中有三个与该模块有关的文件：
</p>

<ul class="org-ul">
<li>insns.h(指令模板结构定义和其它常量定义),</li>
<li>insns.dat(NASM能识别的Intel指令集信息表)，</li>
<li>insns.pl(用于从insns.dat中生成insnsa.c, insnsd.c, insnsi.h, insnsn.c等文件的Perl脚本)。</li>
</ul>

<p>
在insns.pl生成的四个文件中，insnsa.c和insnd.c是C格式的指令集信息表，分别用于
assemble.c和ndisasm.c。insnsi.h是指令集名字的枚举表，insnsn.c是指令集名字的字符串表，
这两个文件用在扫描(nasmlib.c)和反汇编(ndisasm.c)中。
</p>
</div>
</li>

<li><a id="orgc6681a2"></a>为其它模块提供支持的nasmlib.c:<br />
<div class="outline-text-3" id="text-1-9">
<p>
nasmlib.c提供如下函数：
</p>
<ul class="org-ul">
<li>具有报错和记录功能的内存分配和释放函数;</li>
<li>字符串和数字间的转换和赋值函数;</li>
<li>对动态分配的随机存储数组(RAA)和顺序存储数组(SAA)进行管理的函数;</li>
<li>一个标准的源码扫描函数;</li>
<li>表达式处理的库函数;</li>
<li>为目标文件自动添加扩展名的函数;</li>
<li>对源码和目标文件提供支持的其它函数。</li>
</ul>
</div>
</li>

<li><a id="orga9ef702"></a>目标格式文件输出模块output\*out.c和对其进行管理的模块outform.c：<br />
<div class="outline-text-3" id="text-1-10">
<p>
output目录下的*out.c是NASM所能输出的目标格式文件的源代码实现。
每一个输出模块一般只导出一个ofmt形式的数据结构(ofmt数据结构的定义可参见nasm.h文件)。
</p>

<p>
out*.c还提供了对特定格式的附加指令支持。
比如如果在生成OBJ格式时想导入其它DLL的函数，可以使用import指令，
如下将导入wsock32.dll中的函数WSAStartup：
</p>
<blockquote>
<p>
import WSAStartup wsock32.dll
</p>
</blockquote>

<p>
outform.c提供了对上述模块进行查找，列举和注册的功能。
</p>
</div>
</li>
</ol>
</div>

<div id="outline-container-org26dcb3f" class="outline-2">
<h2 id="org26dcb3f"><span class="section-number-2">2</span> 流程简介：</h2>
<div class="outline-text-2" id="text-2">
<p>
主程序nasm.c的流程如下：
</p>

<ol class="org-ol">
<li>初始化需要的数据结构，注册编译器支持的目标文件格式。</li>
<li>使用内部函数parse_cmdline解析命令行参数，设置对应的参数值或输出相应的帮助信息后退出。</li>
<li>如果生成的目标格式中含有附加的标准宏，调用预处理中的函数对其进行注册。</li>
<li>调用函数parser_global_info和eval_global_info分别初始化parser.c和eval.c。</li>
<li>根据变量operating_mode的值判断操作模式，默认为op_normal。
<ul class="org-ul">
<li>如果operating_mode为op_depend(编译时指定了参数-M)，
则对外输出makefile格式的文件依赖关系;</li>
<li>如果operating_mode为op_preprocess(编译时指定了参数-e)，
则只对源代码进行预处理操作，并添加相应的行号信息，然后输出到目标文件或标准输出(stdout);</li>
<li>如果operating_mode为op_normal，则先调用函数init_labels和ofmt-&gt;init
分别初始化label.c和out*.c，
然后调用函数assemble_file对源文件进行编译处理。</li>
</ul></li>
<li>释放掉程序动态分配的内存(RAA和SAA),调用函数eval_cleanup和nasmlib_cleanup
进行相应模块的清理工作。然后根据变量terminate_after_phase的值设置程序返回值并结束运行。</li>
</ol>

<p>
其中的函数 <b><b>assemble_file</b></b> 负责了最主要的工作，它接收源程序文件名，
并调用各个模块对源程序进行预处理，解析，编译，生成指定目标格式文件等操作。
</p>

<p>
<b><b>assemble_file</b></b> 函数流程如下：
</p>

<ol class="org-ol">
<li>初始化目标文件格式中的段(节)和偏移值，初始化预处理模块，设置当前扫描次数。</li>
<li>调用预处理模块中的函数preproc-&gt;getline()返回一行可以被解析使用的“标准”汇编代码，
并增加当前行数。</li>
<li>调用函数getkw(line,&amp;value)来判断当前行格式是否为[directive value]并返回
directive和value相应的值。
这里的directive是指NASM自己的一些伪指令，例如SECTION，EXTERN，GLOBAL等。
若上述格式getkw无法识别，则调用ofmt-&gt;directive (line+1, value, 1)来判断
是否为目标文件格式的附加指令。</li>
<li>若当前行不是上述格式，则调用标准的解析函数parse_line解析当前行。</li>
<li>记录或处理当前行指令中的向前引用。</li>
<li>处理EQU指令，并只在第二次解析时才处理标号前缀为".."的特殊EQU指令。</li>
<li>调用编译模块进行处理。第一次扫描源码时调用insn_size，并对伪指令RESB，DB等调用
函数ofmt-&gt;current_dfmt-&gt;debug_typevalue(typeinfo)来设置调试信息;
第二次扫描时则直接调用assemble来生成目标代码。</li>
<li>调用函数preproc-&gt;cleanup()和nasmlist.cleanup()进行扫描后的清理工作。</li>
<li>若扫描次数小于2,则跳转到(1)进行下一遍扫描。</li>
</ol>
</div>
</div>


<div id="outline-container-org6e5c974" class="outline-2">
<h2 id="org6e5c974"><span class="section-number-2">3</span> 阅读小结</h2>
<div class="outline-text-2" id="text-3">
<p>
通过对NASM源码的阅读，我认为它有以下优点：
</p>
<ol class="org-ol">
<li>采用了模块化的开发模式，各个模块间相对独立，便于扩展功能和修改，也利于被其它程序使用。</li>
<li>预处理功能比较强大，对宏的命名和参数量要求比较灵活。</li>
<li>使用了通过HASH运算将数组和链表结合在一起的数据结构，提高了查找效率。</li>
<li>使用文档和代码间的注释相当齐全，便于他人阅读。</li>
</ol>

<p>
同时，NASM也存在以下问题：
</p>
<ol class="org-ol">
<li>各模块间无法进行相互间的通信。这就导致模块间存在一些重复性代码。
另外在模块内部也有少许重复代码。</li>
<li>listing.c模块和eval.c模块功能简单，特别是listing.c目前尚不完善。</li>
<li>实质上的架构只提供了两遍的源码扫描，这就导致它对表达式的要求比较严格，
不能处理需要多遍扫描才能完成的表达式，这方面的内容可参阅NASM的帮助文档中的
Critical Expressions一节。</li>
<li>在可输出的目标格式文件中，只有少数几个支持生成含有调试信息的目标文件。</li>
</ol>

<hr />
<p>
仓促之间，错漏难免，敬请指正。
    Homepage: <a href="http://www.jingtao.net">www.jingtao.net</a>   
    Email   : <a href="mailto:jingtaozf@gmail.com">jingtaozf@gmail.com</a>
</p>

<p>
Footnotes:
 [1] 虽然NASM不能处理浮点数的的运算，但不意味着它不能利用自己强大的宏功能来
处理类似(eax != 0)的表达式。网友bg7jzw通过在宏中附加指令的方法来使
NASM像MASM一样支持ADDR关键字。同样的方法也可以实现对类似(eax != 0)表达
式的支持。
</p>

<p>
callapi宏如下：
</p>
<div class="org-src-container">
<pre class="src src-asm"><span class="org-comment-delimiter">;</span><span class="org-comment">example: callapi BeginPaint,dword [hWnd], addr [ps]</span>
<span class="org-function-name">%idefine</span> <span class="org-keyword">ADDR</span>               <span class="org-string">"ADDR"</span>,
<span class="org-function-name">%imacro</span> <span class="org-keyword">callapi</span> 1-*
<span class="org-function-name">%assign</span> <span class="org-keyword">i</span>   <span class="org-variable-name">%0</span>
        <span class="org-keyword">%if</span> <span class="org-variable-name">%0</span> &gt; 1
                <span class="org-keyword">%rep</span> <span class="org-variable-name">%0</span> - 1
                        <span class="org-keyword">%rotate</span> -1
                        <span class="org-keyword">%assign</span> i   i-1

                        <span class="org-comment-delimiter">;</span><span class="org-comment">查看前一个数是否为'ADDR'</span>
                        <span class="org-keyword">%rotate</span> -1
                        <span class="org-keyword">%ifidni</span> <span class="org-variable-name">%1</span>,<span class="org-string">"ADDR"</span>
                                <span class="org-comment-delimiter">;</span><span class="org-comment">将参数列表移到当前并处理</span>
                                <span class="org-keyword">%rotate</span> 1
                                <span class="org-keyword">lea</span> eax,    <span class="org-variable-name">%1</span>
                                <span class="org-keyword">push</span>        eax
                                <span class="org-comment-delimiter">;</span><span class="org-comment">跳过ADDR参数</span>
                                <span class="org-keyword">%rotate</span> -1
                                <span class="org-keyword">%assign</span> i   i-1
                        <span class="org-keyword">%else</span>
                                <span class="org-keyword">%rotate</span> 1
                                <span class="org-keyword">xpush</span> {<span class="org-variable-name">%1</span>}
                        <span class="org-keyword">%endif</span>


                        <span class="org-keyword">%if</span> i &lt;=1
                                <span class="org-keyword">%exitrep</span>
                        <span class="org-keyword">%endif</span>
                <span class="org-keyword">%endrep</span>
                <span class="org-keyword">%rotate</span> -1
        <span class="org-keyword">%endif</span>
        <span class="org-keyword">extern</span>      <span class="org-variable-name">%1</span>
        <span class="org-keyword">call</span>        [<span class="org-variable-name">%1</span>]
<span class="org-function-name">%endmacro</span>
</pre>
</div>

<p>
<i><b>$Id: nasm_1.html,v 1.6 2003/12/09 10:39:09 jingtao Exp $</b></i>
</p>
</div>
</div>
</div>
</body>
</html>
